Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་ཅི་ནས་ཀྱང་ཟག་པ་རྣམས་ཡང་དག་པ་མ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པར་འགྱུར་བ་དང་།
en: In this manner, the tathāgatas make them know in accordance with reality that contaminants are not real.

source: རབ་ཏུ་ཤེས་ནས་ཀྱང་ཆོས་གང་ཡང་མི་ལེན་ཏེ
en: And having known that, they do not cling to any phenomenon.

source: དེ་དག་མི་ལེན་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་དེ་ལྟ་
en: Due to their lack of clinging, they pass completely beyond sorrow.

source: དེ་ལྟར་དཔེ་ཉེ་བར་བཀོད་པའི་དཔེ་རྣམས་ཀྱིས་ཆོས་སྟོན་ཏེ།
en: In this way, they teach the Dharma through well-conceived illustrations.

source: རིགས་ཀྱི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་པའོ། །
en: Son of noble family, this is the tenth tathāgata activity of the tathāgatas.

source: འདྲེན་པའི་ཟག་པ་ཟད་པ་མཁྱེན་པ་ནི། །ཤིན་ཏུ་རྒྱ་ཆེ་མ་བསྒྲིབས་ཚད་མེད་ལྡན། །
en: “ ‘The guides’ knowledge of the depletion of contaminants Is exceedingly vast, unobscured, and limitless.

source: སྟོབས་བཅུ་སྟོབས་ནི་དེ་ཡིས་བྱང་ཆུབ་མཆོག །ཞི་བ་འདི་ནི་རྟོགས་ཤིང་རབ་ཏུ་ཕྱེ། །
en: Through the strength of the ten strengths, The peace of supreme awakening is realized and fully discerned.

source: ཉན་ཐོས་རྣམས་ཀྱི་ཟག་ཟད་ཤེས་པ་ནི། །བག་ཆགས་མ་བཅོམ་ཚད་དང་ལྡན་པ་ཡིན། །
en: “ ‘The śrāvakas’ knowledge of the depletion of contaminants Does not destroy karmic traces and is limited.

source: མི་ཡི་མཆོག་གི་རབ་མཆོག་འདྲེན་པ་ཡི། །བག་ཆགས་བཅོམ་ཞིང་ཚད་དང་ལྡན་མ་ཡིན། །
en: But the knowledge of the supreme guides, excellent among humans, Destroys karmic traces and is unlimited.

source: དེ་བཞིན་གང་དག་རང་རྒྱལ་བྱང་ཆུབ་རེག །
en: “ ‘Likewise, for pratyekabuddhas who reach their awakening

source: དེ་ལ་སྙིང་རྗེ་ཆེ་དང་སྤོབས་པ་མེད། །
en: With no great compassion or courage,

source: ཟག་པ་དག་ནི་ཡོངས་སུ་ཟད་གྱུར་ནས། །
en: Once their contaminants have been completely depleted,

source: སྙིང་རྗེ་ཆེ་དང་སྤོབས་པ་ཚད་ཀྱང་མེད། །
en: Their great compassion and courage will also be limitless.

source: སངས་རྒྱས་ཟག་ཟད་མཁྱེན་ལ་གནས་ནས་ནི། །འགྲོ་བའི་ཟག་པ་ཡང་དག་མ་ཡིན་མཁྱེན། །
en: “ ‘Once the buddha knowledge of the depletion of contaminants is present, They come to know that the contaminants of beings are unreal.

source: རིགས་པའི་གནས་ཀྱི་ཚུལ་འདི་མ་ཤེས་པས། །སེམས་ཅན་འདི་དག་ཐམས་ཅད་ལོག་པར་སྦྱོར། །
en: By not knowing this crucial point, Those sentient beings get it all wrong.

source: དེ་ལ་རྒྱལ་བས་སྙིང་རྗེ་མི་ཟད་བསྐྱེད། །
en: “ ‘The victors engendered inexhaustible compassion toward them,

source: མི་རྟག་སྟོང་པ་བདག་མེད་ཆོས་ཀྱང་སྟོན། །
en: Teaching that phenomena are impermanent, empty, and selfless:

source: ཆོས་འདི་དངོས་མེད་སྒྱུ་མ་ལྟ་བུར་ནི། །རྟོགས་ལ་
en: “Understand these phenomena to be unreal and illusory

source: ཞི་མཆོག་ཡང་དག་ཐོབ་པར་གྱིས། །
en: And truly attain supreme peace!”

source: འདི་ནི་སྲོག་དང་གང་ཟག་ཤེད་སྐྱེས་དང་། །ཤེད་བུ་དེ་བཞིན་བྱེད་པ་པོ་མེད་ཀྱང་། །སེམས་ཅན་འདི་ཀུན་ལོག་པར་ཞེན་པས་ན། །
en: “ ‘Even though there are no creatures, Individuals, human beings, humankind, or agents of actions, All these beings cling to what is completely wrong—

source: སྙིང་རྗེ་བསྐྱེད་པ་སྟོན་པ་ཐར་པར་འཆད། །
en: Thus the teachers who engender compassion explain liberation.

source: བདེ་བར་གཤེགས་ལ་ཡོངས་སུ་སྐྱོ་མེད་ཅིང་། །
en: “ ‘The sugatas never grow weary.

source: ཡང་དག་ཤེས་ལ་ནམ་ཡང་ཉེས་པ་མེད། །
en: Knowing reality, they are never wrong.

source: དེས་ནི་རྒྱལ་བ་རྟག་ཏུ་རྣལ་འབྱོར་བརྩོན། །འགྲོ་ལ་ཕན་ཕྱིར་ཆོས་ཀྱང་རབ་ཏུ་སྟོན། །
en: Therefore, the victors are always diligently engaged, Teaching the Dharma to benefit beings.

source: འདི་ནི་ཕ་རོལ་རྒོལ་བ་རབ་འདུལ་བ། །སྟོབས་བཅུ་ལྡན་གྱི་རྒྱལ་དང་འཐུན་པའི་ལས། །
en: “ ‘Subduing opponents completely Is an action in line with the victory of possessing the ten strengths.

source: སྟོབས་བཅུ་མངའ་བ་སྟོབས་དེར་གནས་ནས་ནི། །མཚུངས་མེད་འཁོར་ལོ་དམ་པ་རབ་ཏུ་བསྐོར།། །།
en: Dwelling in the power of possessing the ten strengths, They fully turn the incomparable noble wheel.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བཞི་པོ་དག་ལ་རབ་ཏུ་གནས་ཏེ།
en: (11) “Son of noble family, the tathāgatas dwell in the tathāgatas’ four types of fearlessness.

source: འཕྲིན་ལས་མཛད་ཅིང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བདག་ཉིད་ཞལ་གྱིས་འཆེ་བ་དེ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གང་གིས་ཀྱང་ཁྱོད་ཀྱིས་ཆོས་འདི་དག་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་སོ་ཞེས་ཆོས་དང་འཐུན་པས་དེ་བཞིན་གཤེགས་པ་ལ་རྒོལ་མི་ནུས་སོ། །
en: No one in the world with its gods can reasonably reprove the tathāgatas, saying, ‘You have not become completely and perfectly awakened regarding phenomena,’ in response to their proclamation, ‘We perform awakened deeds and have become completely and perfectly awakened.’

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱ་ཞེ་ན་
en: “Why is it that tathāgatas declare that they are completely and perfectly awakened?

source: དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མི་མཉམ་པ་མེད་པར་ཡང་དག་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: The tathāgatas are completely and perfectly awakened to the fact that all phenomena are equal.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། སློབ་པའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། མི་སློབ་པའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པས་མཉམ་པ་ཉིད་དུ་ཡང་དག་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: They are completely and perfectly awakened to the fact that the phenomena of ordinary people, those engaged in learning, those in a state of no more learning, pratyekabuddhas, bodhisattvas, and buddhas are all equal.

source: འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པས་མཉམ་པ་ཉིད་དུ་ཡང་དག་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: They are completely and perfectly awakened to the fact that mundane, supramundane, flawed, unflawed, contaminated, uncontaminated, conditioned, and unconditioned phenomena are all equal.

source: དེ་ལ་མཉམ་པ་ཉིད་གང་ཞེ་ན།
en: “How are they equal?

source: ལྟ་བའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཉིད་དུ་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential view, they are equal in their emptiness.

source: མཚན་མའི་ངོ་བོ་ཉིད་ཀྱིས་མཚན་མ་མེད་པར་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential sign, they are equal in being signless.

source: ཁམས་གསུམ་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྨོན་པ་མེད་པར་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential nature of the three realms, they are equal in being wishless.

source: སྐྱེ་བའི་ངོ་བོ་ཉིད་ཀྱིས་མི་སྐྱེ་བར་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential nature of birth, they are equal in being unborn.

source: མངོན་པར་འདུ་བྱེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་མངོན་པར་འདུ་བྱེད་པ་མེད་པར་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential nature of conditioning, they are equal being without conditioning.

source: འབྱུང་བའི་ངོ་བོ་ཉིད་ཀྱིས་འབྱུང་བ་མེད་པར་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential nature of origination, they are equal in being without origination.

source: ཀུན་གཞིའི་ངོ་བོ་ཉིད་ཀྱིས་ཀུན་གཞི་མེད་པར་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential nature of the substratum consciousness, they are equal in having no substratum consciousness.

source: དུས་གསུམ་གྱི་ངོ་བོ་ཉིད་ཀྱིས་ཇི་ལྟ་བ་བཞིན་དུ་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential nature of the three times, they are equal in accordance with reality.

source: མ་རིག་པ་དང་། སྲིད་པ་དང་། སྲེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་རིག་པ་དང་རྣམ་པར་གྲོལ་བར་མཉམ་པ་ཉིད་དོ། །
en: In terms of the essential nature of ignorance, becoming, and craving, they are equal in being knowledge and liberation.

source: འཁོར་བའི་ངོ་བོ་ཉིད་ཀྱིས་མྱ་ངན་ལས་འདས་པར་མཉམ་པ་ཉིད་དེ།
en: In terms of the essential nature of saṃsāra, they are equal in being nirvāṇa.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པས་དེའི་ཕྱིར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱའོ། །
en: Thus, the tathāgatas are completely and perfectly awakened to the equality of all phenomena, and that is why they declare, ‘We are completely and perfectly awakened.’

source: དེ་བཞིན་གཤེགས་པས་ཇི་ལྟར་ཆོས་དེ་དག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་བཞིན་དུ་ཐུགས་རྗེ་ཆེན་པོ་ལ་གནས་ཏེ་
en: “Just as the tathāgatas have become completely and perfectly awakened with regard to those phenomena, in the same way they abide in great compassion.

source: བསྟན་པ་སྣ་ཚོགས་དང་། རྣམ་གྲངས་སྣ་ཚོགས་དང་། རྐྱེན་སྣ་ཚོགས་རྣམས་ཀྱིས་སེམས་ཅན་གཞན་དག་དང་གང་ཟག་གཞན་རྣམས་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ
en: They teach other people and beings by means of various Dharmas, discourses, and circumstances.

source: དེའི་ཆོས་དེ་ཡང་དེ་བྱེད་པའི་སྡུག་བསྔལ་ཡང་དག་པར་ཟད་པར་བྱ་བའི་ཕྱིར་ངེས་པར་འབྱུང་ངོ་། །
en: Their Dharma arises for the sake of eliminating created suffering.

source: གང་དག་སྟོན་པ་མ་ཡིན་པར་སྟོན་པའོ་ཞེས་ཁས་འཆེ་བ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་ཡིན་པར་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་ཁས་འཆེ་བ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་འདིས་ཟིལ་གྱིས་ནོན་པར་འགྱུར་ཞིང་མེད་པར་ཡང་འགྲོ་བར་འགྱུར་ཏེ
en: “This tathāgata fearlessness overpowers and annuls allegations such as ‘They say they are teachers when they are not’ and ‘They say they are completely and perfectly awakened when they are not.’

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་གཅིག་པའོ། །
en: This is the eleventh tathāgata activity of the tathāgatas.

source: རང་བྱུང་གིས་ནི་ཆོས་རྣམས་ཀུན། །མཉམ་པ་ཉིད་དུ་རྗེས་རྟོགས་པས། །
en: “ ‘The spontaneously arisen ones Have realized all phenomena to be equal.

source: དེས་ན་ཡང་དག་རྫོགས་སངས་རྒྱས། །
en: Therefore they are completely and perfectly awakened.

source: དེ་བཞིན་གཤེགས་པས་མཉམ་པར་གཟིགས། །
en: The tathāgatas see equality.

source: སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་དང་། །
en: “ ‘The phenomena of ordinary people,

source: སློབ་དང་མི་སློབ་ཆོས་རྣམས་དང་། །
en: The phenomena of those engaged in learning or no more learning,

source: རང་རྒྱལ་ཆོས་རྣམས་གང་ཡིན་པ། །
en: And the phenomena of pratyekabuddhas

source: དེ་དག་སངས་རྒྱས་ཆོས་དང་མཉམ། །
en: Are all equal to the phenomena of buddhas.

source: འཇིག་རྟེན་པ་དང་དེ་བཞིན་དུ། །འཇིག་རྟེན་ལས་ནི་འདས་པ་དང་། །དགེ་དང་མི་དགེ་གང་ཡིན་པ། །མྱ་ངན་འདས་དང་མཚུངས་ཤིང་འདྲ། །
en: “ ‘The mundane and, likewise, The supramundane, As well as virtue and nonvirtue, Are similar and equal to nirvāṇa.

source: སྟོང་པ་མཚན་མ་མེད་པ་དང་། །སྨོན་པ་རྣམ་པར་སྤངས་པ་དང་། །སྐྱེ་མེད་མངོན་པར་འདུ་མི་བྱེད། །ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་གཟིགས། །
en: “ ‘Empty, signless, Wishless, unborn, And unconditioned, They are all seen to be equal.

source: དེ་དག་རྟོགས་ནས་ཐུགས་རྗེ་ཡིས། །སེམས་ཅན་རྣམས་ལ་རབ་སྟོན་ཏོ། །
en: “ ‘Having realized those, They teach beings with compassion.

source: དེས་ན་སེམས་ཅན་རྣམ་པར་འགྲོལ། །
en: Therefore beings are liberated.

source: འདི་ནི་ཐུབ་པའི་ལས་ཀྱི་མཆོག །
en: This is the supreme activity of the capable ones.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ང་ཟག་པ་ཟད་དོ་ཞེས་བདག་ཉིད་ཞལ་གྱིས་འཆེ་བ་དེ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གང་གིས་ཀྱང་ཁྱོད་ཟག་པ་འདི་དག་མ་ཟད་དོ་ཞེས་ཆོས་དང་འཐུན་པས་དེ་བཞིན་གཤེགས་པ་ལ་རྒོལ་མི་ནུས་སོ། །
en: (12) “Son of noble family, no one in the world with its gods can reasonably reprove the tathāgatas, saying, ‘You have not eliminated those contaminants’ in response to their proclamation, ‘We have eliminated contaminants.’

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་ནི་འདི་ཡིན་ཏེ།
en: “The tathāgatas’ depletion of contaminants occurs in the following manner:

source: འདོད་པའི་ཟག་པ་རྣམས་ལས་དེ་བཞིན་གཤེགས་པའི་སེམས་རྣམ་པར་གྲོལ་བས་འདོད་ཆགས་ལ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་ལེགས་པར་བཅོམ་མོ། །
en: Since the minds of tathāgatas are freed from the contaminants of desire, they have destroyed all karmic traces that partake of attachment.

source: སྲིད་པའི་ཟག་པ་རྣམས་ལས་དེ་བཞིན་གཤེགས་པའི་སེམས་རྣམ་པར་གྲོལ་བས་ཞེ་སྡང་ལ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་ལེགས་པར་བཅོམ་མོ། །
en: Since the minds of tathāgatas are freed from the contaminants of becoming, they have destroyed all karmic traces that partake of anger.

source: མ་རིག་པའི་ཟག་པ་རྣམས་ལས་དེ་བཞིན་གཤེགས་པའི་སེམས་རྣམ་པར་གྲོལ་བས་གཏི་མུག་ལ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་ལེགས་པར་བཅོམ་མོ། །
en: Since the minds of tathāgatas are freed from the contaminant of ignorance, they have destroyed all karmic traces that partake of delusion.

source: ལྟ་བའི་ཟག་པ་རྣམས་ལས་དེ་བཞིན་གཤེགས་པའི་སེམས་རྣམ་པར་གྲོལ་བས་ཉོན་མོངས་པ་ལ་སྤྱོད་པའི་བག་ཆགས་ཐམས་ཅད་ལེགས་པར་བཅོམ་སྟེ།
en: Since the minds of tathāgatas are freed from the contaminants of views, they have destroyed all karmic traces that partake of afflictive emotion.

source: དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཉེ་བར་བཟུང་ནས་དེ་བཞིན་གཤེགས་པ་ཟག་པ་ཟད་པ་ཞེས་བྱའོ། །
en: “Therefore, from a conventional worldly point of view, the tathāgatas are said to have depleted the contaminants.

source: དོན་དམ་པར་ན་ནི་འཕགས་པའི་ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱི་མདུན་ན་གང་ཡོངས་སུ་ཤེས་པར་བྱ་བའམ་སྤང་བར་བྱ་བའམ། བསྒོམ་པར་བྱ་བའམ་མངོན་སུམ་དུ་བྱ་བར་འགྱུར་བའི་ཆོས་གང་ཡང་མི་གནས་སོ། །
en: However, ultimately, from the perspective of the insight and wisdom of the noble ones, phenomena that are to be known, abandoned, cultivated, or realized are never established.

source: གང་ཟད་པ་ཞེས་བྱ་བ་དེ་ནི་ནམ་དུ་ཡང་མི་ཟད་པ་ཡིན་ནོ། །
en: The ‘depleted’ are never not depleted.

source: དེ་ནི་ཤིན་ཏུ་ཟད་པ་ཉིད་ཡིན་གྱི་གཉེན་པོས་ཟད་པ་ཞེས་ནི་མི་བྱ་སྟེ།
en: They are totally depleted, but they are not ‘depleted by means of an antidote.’

source: དེ་ནི་ཇི་ལྟ་བ་བཞིན་དུ་ཟད་པའོ། །
en: Their depletion accords with reality.

source: ཇི་ལྟ་བ་བཞིན་དུ་ཟད་པ་གང་ཡིན་པ་དེ་ལ་ཟད་པ་གང་ཡང་མེད་དོ། །
en: That depletion that accords with reality is devoid of anything depleted.

source: གང་ལ་ཟད་པ་གང་ཡང་མེད་པ་དེ་འདུས་མ་བྱས་པའོ། །
en: That which is devoid of anything anywhere depleted is called unconditioned.

source: འདུས་མ་བྱས་པ་གང་ཡིན་པ་དེ་ལ་སྐྱེ་བ་མེད། འཇིག་པ་མེད། གནས་པ་མེད་དེ།
en: The unconditioned is unborn, does not endure, and does not deteriorate.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་དེ་ནི་གནས་པ་ཉིད་དོ། །
en: “Therefore, whether tathāgatas appear or not, that which is the nature of reality and the realm of phenomena prevails.

source: ཆོས་ཀྱི་དབྱིངས་དེ་ཇི་ལྟར་གནས་པ་དེ་བཞིན་དུ་དེ་ལ་ཡེ་ཤེས་ཞུགས་ཏེ།
en: Just as the realm of phenomena prevails, in the same way wisdom prevails within it.

source: ཇི་ལྟར་འཇུག་པ་མེད་པ་དང་། ལྡོག་པ་མེད་པ་དེ་ལྟར་ཞུགས་སོ། །
en: Just as it is without engagement or withdrawal, wisdom prevails in the same manner.

source: དེ་ལྟ་བུའི་ཆོས་ཀྱི་ཚུལ་གྱིས་ཟག་པ་དང་། ཟག་པ་སྤོང་བ་མི་དམིགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་ཐུགས་རྗེ་ཆེན་པོ་ལ་གནས་ནས་སེམས་ཅན་རྣམས་ཀྱི་ཟག་པ་སྤང་བའི་ཕྱིར་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ།
en: “The tathāgatas, who, in accordance with the way of the Dharma, do not objectify the contaminants or their abandonment, are settled in great compassion and teach the Dharma to sentient beings so that they may abandon their contaminants.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་གཉིས་པའོ། །
en: This is the twelfth tathāgata activity of the tathāgatas.

source: རྒྱལ་བས་འདོད་པའི་ཟག་པ་སྤངས་པས་ན།
en: “ ‘The victors have abandoned the contaminants of desire,

source: འདོད་ཆགས་བག་ཆགས་ཕྱིས་ནི་ཡོད་མ་ཡིན། །
en: Thus they have no further karmic traces of attachment.

source: མི་དབང་སྲིད་པ་ཀུན་ལས་རྣམ་གྲོལ་བས། །
en: The lords of humans are freed from all further becoming,

source: དེ་ཡི་ཉེས་པ་མ་ལུས་ཡང་དག་འཆད། །
en: Thus all faults without exception are cut off.

source: བདེ་གཤེགས་རིག་པ་ཀུན་ལ་གནས་པས་ན། །
en: “ ‘The sugatas are established in knowledge of all kinds,

source: དེ་ཡི་གཏི་མུག་ལྷག་མ་མ་ལུས་བྲལ། །
en: Thus they are free of any residual delusion.

source: མི་ཡི་སེང་གེ་ལྟ་བ་ཀུན་དང་བྲལ། །
en: The lions among humans are free from any view,

source: དེས་ནི་ཉོན་མོངས་སྤྱོད་པའི་བག་ཆགས་མེད། །
en: Thus they are without any karmic traces that partake of afflictive emotions.

source: ཀུན་གྱིས་ཟག་པ་ཟད་པ་འཐོབ་འགྱུར་བར། །
en: “ ‘In order that all attain the depletion of contaminants,

source: རྒྱལ་བ་ཀུན་རྫོབ་ཏུ་ནི་ཆོས་སྟོན་ཏོ། །
en: The victorious ones teach the Dharma at the conventional level.

source: གང་ཞིག་འཕེལ་བ་དང་ནི་ཟད་འགྱུར་བ། །
en: Phenomena that increase or are depleted

source: ཆོས་དེ་དམ་པའི་དོན་དུ་ཡོད་མ་ཡིན། །
en: Do not exist ultimately.

source: ཟད་པ་གཉེན་པོས་ཟད་པ་མ་ཡིན་ཏེ། །
en: “ ‘For them, depletion is not depletion by means of an antidote,

source: སྔོན་ནས་ཟད་པས་དེ་ཕྱིར་ཟད་ཅེས་བསྟན། །
en: Because there was already depletion before that depletion was taught.

source: ཟད་པ་གང་ཡིན་དེ་ནི་འདུས་མ་བྱས། །
en: That which is depleted is unconditioned

source: དེ་ལ་མཚན་ཉིད་གསུམ་ནི་ཡོད་མ་ཡིན། །
en: And is therefore not something that possesses the three characteristics.

source: དབྱིངས་དེ་གནས་པ་ཡིན་ཏེ་འགྱུར་བ་མེད། །
en: “ ‘The realm of phenomena endures without change.

source: དབང་གི་ཕ་རོལ་སོན་པས་ཆོས་རྣམས་མཁྱེན། །
en: With perfected faculties phenomena are known.

source: དེ་དག་ཤེས་ནས་དེ་བཞིན་ཆོས་སྟོན་ཏེ། །
en: Knowing them, they teach the Dharma accordingly.

source: འདི་ནི་རྒྱལ་བའི་འཕྲིན་ལས་བཅུ་གཉིས་པ། །
en: This is the twelfth activity of the victors.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་བར་དུ་གཅོད་པའི་ཆོས་རྣམས་མཚུངས་པར་བར་དུ་གཅོད་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་པ་དེ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གང་གིས་ཀྱང་ཆོས་འདི་དག་བར་དུ་གཅོད་པར་མི་འགྱུར་རོ་ཞེས་ཆོས་དང་འཐུན་པས་དེ་བཞིན་གཤེགས་པ་ལ་རྒོལ་མི་ནུས་སོ། །
en: (13) “Son of noble family, the tathāgatas know in accordance with reality which obstructing factors obstruct. No one in the world with its gods is able to reasonably reprove the tathāgatas, saying, ‘Those factors do not obstruct.’

source: དེ་ལ་བར་དུ་གཅོད་པའི་ཆོས་རྣམས་གང་ཞེ་ན།
en: What are the obstructing factors?

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་གཅིག་སྟེ། གཅིག་གང་ཞེ་ན་འདི་ལྟ་སྟེ། དང་བ་མེད་པའི་སེམས་སོ། །
en: There is one [obstructing factor]: a mind that lacks faith.

source: བར་དུ་གཅོད་པའི་ཆོས་གཉིས་ཏེ། གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ་ངོ་ཚ་མི་ཤེས་པ་དང་། ཁྲེལ་མེད་པའོ། །
en: There are two [obstructing factors]: immodesty and impropriety.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་གསུམ་སྟེ། གསུམ་གང་ཞེ་ན་འདི་ལྟ་སྟེ། ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པ་དང་། ངག་གིས་ཉེས་པར་སྤྱད་པ་དང་། ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པ་སྟེ། གསུམ་པོ་འདི་དག་གོ། །
en: There are three [obstructing factors]: misconduct of body, speech, and mind.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བཞི་སྟེ། བཞི་གང་ཞེ་ན་འདི་ལྟ་སྟེ། འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་བཞི་སྟེ། འདུན་པས་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་དང་། ཞེ་སྡང་གིས་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་དང་། གཏི་མུག་གིས་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་དང་། འཇིགས་པས་འགྲོ་བ་མ་ཡིན་པར་འགྲོ་བ་སྟེ། བཞི་པོ་འདི་དག་གོ། །
en: There are four [obstructing factors]: going wrong because of desire, aversion, delusion, or fear.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་ལྔ་སྟེ། ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཆང་འཐུང་བ་སྟེ། ལྔ་པོ་འདི་དག་གོ། །
en: There are five [obstructing factors]: killing, stealing, sexual misconduct, lying, and consuming intoxicants.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་དྲུག་སྟེ། དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་ལ་མ་གུས་པ་ཡིན། ཆོས་ལ་མ་གུས་པ་ཡིན། དགེ་འདུན་ལ་མ་གུས་པ་ཡིན། བསླབ་པ་ལ་མ་གུས་པ་ཡིན། ཏིང་ངེ་འཛིན་ལ་མ་གུས་པ་ཡིན། གདིང་བ་ལ་མ་གུས་པ་ཡིན་ཏེ། དྲུག་པོ་འདི་དག་གོ། །
en: There are six [obstructing factors]: irreverence toward the Buddha, the Dharma, and the Saṅgha and irreverence toward the training, meditative absorption, and the meditation cushion.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བདུན་ཏེ། བདུན་གང་ཞེ་ན་འདི་ལྟ་སྟེ། ང་རྒྱལ་དང་། ཆེ་བའི་ང་རྒྱལ་དང་། ང་རྒྱལ་ལས་ཀྱང་ང་རྒྱལ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་དང་། མངོན་པའི་ང་རྒྱལ་དང་། ཆུང་ཟད་སྙམ་པའི་ང་རྒྱལ་དང་། ལོག་པའི་ང་རྒྱལ་ཏེ། བདུན་པོ་འདི་དག་གོ། །
en: There are seven [obstructing factors]: ordinary pride, the pride of superiority, excessive pride, the pride that thinks ‘I am,’ manifest pride, the inverted pride of self-abasement, and mistaken pride.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བརྒྱད་དེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལོག་པའི་ལྟ་བ་དང་། ལོག་པའི་རྟོག་པ་དང་། ལོག་པའི་ངག་དང་། ལོག་པའི་ལས་ཀྱི་མཐའ་དང་། ལོག་པའི་འཚོ་བ་དང་། ལོག་པའི་རྩོལ་བ་དང་། ལོག་པའི་དྲན་པ་དང་། ལོག་པའི་ཏིང་ངེ་འཛིན་ཏེ། བརྒྱད་པོ་འདི་དག་གོ། །
en: There are eight [obstructing factors]: wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, and wrong absorption.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་དགུ་སྟེ། དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: There are nine [obstructing factors]:

source: བདག་ལ་གནོད་པ་བྱས་སོ་བྱེད་དོ། །བྱེད་པར་འགྱུར་རོ་ཞེས་ཀུན་ནས་མནར་སེམས་ཀྱི་སེམས་སྐྱེད་པ་དང་།
en: giving rise to miserable states of mind such as ‘I was harmed,” ‘I am being harmed,’ or ‘I will be harmed’;

source: བདག་གི་མཛའ་བོ་གང་ཡིན་པ་དེ་ལ་གནོད་པ་བྱས་སོ། །བྱེད་དོ། །བྱེད་པར་འགྱུར་རོ་ཞེས་ཀུན་ནས་མནར་སེམས་ཀྱི་སེམས་སྐྱེད་པ་དང་།
en: giving rise to miserable states of mind such as ‘My friends were harmed,’ ‘They are being harmed,’ or ‘They will be harmed’;

source: བདག་དང་མི་མཛའ་བ་གང་ཡིན་པ་དེའི་དོན་བྱས་སོ། །བྱེད་དོ། །བྱེད་པར་འགྱུར་རོ་ཞེས་ཀུན་ནས་མནར་སེམས་ཀྱི་སེམས་སྐྱེད་པ་སྟེ་དགུ་པོ་འདི་དག་གོ། །
en: and giving rise to miserable states of mind such as ‘Those who are not my friends have benefited,’ ‘They are benefitting,’ or ‘They will benefit.’

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་བཅུ་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: There are ten [obstructing factors]:

source: མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡིན་ནོ། །བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ། སྲོག་གཅོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པ་ལ་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ངག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བ་སྟེ།
en: the ways of the ten nonvirtuous actions of killing, stealing, and sexual misconduct, lying, slander, harsh words, and idle chatter, and covetousness, maliciousness, and wrong views.

source: ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པའི་ཀུན་དུ་སྦྱོར་བར་འགྱུར་བའི་ཆོས་རྣམས་རོ་མྱང་བ་ལ་རྗེས་སུ་ལྟ་ཞིང་གནས་པ་དང་། ཕྱིན་ཅི་ལོག་དང་ལྡན་པ་དང་། སྒྲིབ་པས་ཀུན་ནས་དཀྲིས་པ་དང་། སྲིད་པ་དང་ལྟ་བ་ལ་མངོན་པར་ཞེན་པའི་ཟང་ཟིང་དང་བཅས་པ་དང་། ཕུང་པོ་དང་བཅས་པའི་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བར་དུ་གཅོད་པའི་ཆོས་སུ། དེ་བཞིན་གཤེགས་པས་མཁྱེན་ཅིང་
en: “Tathāgatas know the following to be obstructing factors: becoming engrossed in the taste of factors that are entangled with incorrect mental activity, being mistaken, being ensnared by obscurations, and being disordered by clinging to existence and to views, as well as any physical, verbal, or mental acts encumbered by the aggregates.

source: བར་དུ་གཅོད་པར་འགྱུར་རོ་ཞེས་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་ཏེའདི་དག་ནི་བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་རྣམས་སོ། །
en: Declaring, ‘These are obstructing factors,’ they teach them as such, in accordance with reality.

source: བར་དུ་གཅོད་པར་འགྱུར་བའི་ཆོས་དེ་དག་ཞི་བར་བྱ་བ་དང་། ཉེ་བར་ཞི་བར་བྱ་བ་དང་། སྤང་བར་བྱ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པས་ཆོས་སྟོན་ཏེ།
en: The tathāgatas teach the Dharma in order that these obstructing factors are pacified, calmed, and abandoned.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་བཅུ་གསུམ་པའོ། །
en: This is the thirteenth tathāgata activity of the tathāgatas.

source: རྒྱལ་བ་ཡིས་ནི་ཆོས་གང་རྗེས་རྟོགས་པ། །དེ་དག་བསྟེན་ན་རྣམ་པར་གྲོལ་མི་འཐོབ། །
en: “ ‘Those who rely on factors realized by the victors as obstructing Will not attain liberation:

source: གང་ལ་དད་པ་སྤང་བ་ཡོད་པ་དང་། །
en: Discarding devotion

source: གང་ལ་ངོ་ཚ་ཁྲེལ་ལྟས་ཆུང་ཟད་མེད། །
en: And lacking the slightest modesty or propriety,

source: དེ་བཞིན་ལུས་དང་ངག་དང་སེམས་སྡོམ་པ། །གང་དག་ལ་ནི་ནམ་ཡང་མེད་པ་དང་། །འདུན་པ་དང་ནི་ཞེ་སྡང་གཏི་མུག་ནས། །སྲོག་གཅོད་གཞན་གྱི་ལོངས་སྤྱོད་འཇིག་པའི་བདག །
en: “ ‘Likewise having no restraint whatsoever In body, speech, and mind, Having desire, aversion, and delusion, Killing and destroying the property of others,

source: གཞན་གྱི་ཆུང་མ་བརྫུན་སྨྲ་དེ་བཞིན་ཆང་། །
en: “ ‘Taking another’s wife, lying, or consuming intoxicants,

source: མ་གུས་དྲུག་པོ་དག་དང་ང་རྒྱལ་བདུན། །ལོག་པ་བརྒྱད་ནི་གང་ཡིན་དེ་དག་ཀྱང་། །ཐམས་ཅད་རྣམ་པར་གྲོལ་བའི་ལམ་གྱི་བགེགས། །
en: Lacking the six kinds of reverence and having the seven kinds of pride, And engaging in the eight kinds of misdeeds— These all obstruct the path to liberation.

source: ཀུན་ནས་མནར་སེམས་དངོས་པོ་དགུར་གསུངས་དང་། །
en: “ ‘The miserable states of mind said to be ninefold,

source: མི་དགེ་བཅུ་པོའི་ལས་ཀྱི་ལམ་རྣམས་དང་། །
en: The ways of the ten nonvirtuous actions—
